{
  "version": "5.4.0",
  "releaseDate": "2025-11-16",
  "appName": "PRISMA Solar",
  "subtitle": "Pricing Reliable Intelligence System for Management and Analysis",
  "changelog": [
    {
      "version": "5.4.0",
      "date": "2025-11-16",
      "title": "Mobile-First Design & Smart Data Management",
      "features": [
        {
          "type": "new",
          "title": "Rounded Corners Everywhere",
          "description": "Design completamente rinnovato con angoli arrotondati su tutte le sezioni e componenti. Interfaccia moderna in stile iOS per un'esperienza visiva premium su mobile e desktop."
        },
        {
          "type": "new",
          "title": "Smart Client-Installation Linking",
          "description": "Auto-selezione intelligente dell'impianto collegato quando selezioni un cliente. Il sistema carica automaticamente tutti i dati dell'impianto già salvato, riducendo il tempo di inserimento dati."
        },
        {
          "type": "new",
          "title": "Dynamic Save Button",
          "description": "Pulsante 'Salva e Collega' intelligente che cambia colore, icona e messaggio in base al contesto: verde per nuovo impianto, blu per nuovo cliente, arancione per aggiornamenti, con testi dinamici che guidano l'utente."
        },
        {
          "type": "new",
          "title": "Installation Name Required",
          "description": "Campo 'Nome Impianto' ora obbligatorio per una migliore organizzazione. Tutti gli impianti devono avere un nome identificativo chiaro per facilitare la ricerca e gestione."
        },
        {
          "type": "new",
          "title": "Modern Toggle Switch",
          "description": "Checkbox 'Impianto Completato' trasformato in elegante toggle switch iOS-style con card colorata (verde quando attivo). Design touch-friendly ottimizzato per mobile con icone dinamiche."
        },
        {
          "type": "new",
          "title": "Enhanced Session Management",
          "description": "Salvataggio e ripristino automatico di cliente e impianto selezionati nelle sessioni. Non dovrai più riselezionare i dati quando riprendi il lavoro - tutto resta come lo hai lasciato."
        },
        {
          "type": "improved",
          "title": "Mobile-Optimized Version Popup",
          "description": "Popup versione completamente ridisegnato per mobile: fullscreen con angoli arrotondati, scrollbar nascosta, testo più grande, tap target ottimizzati. Chiusura X rimossa - usa il pulsante Close in basso."
        },
        {
          "type": "improved",
          "title": "Sopralluogo Layout Optimization",
          "description": "Campi Data e Ora nel Programma Sopralluogo ora si dispongono verticalmente su mobile per un input più facile e preciso. Layout intelligente che si adatta automaticamente alle dimensioni dello schermo."
        },
        {
          "type": "improved",
          "title": "Streamlined Data Structure",
          "description": "Rimosso campo Comune ridondante - la città viene salvata solo nei dati cliente per evitare duplicazioni. Struttura dati più pulita e manutenibile."
        },
        {
          "type": "fixed",
          "title": "Airtable Save Errors",
          "description": "Risolti errori di salvataggio Airtable per campi select vuoti e campo 'comune' inesistente. Ora invia solo campi con valori validi, eliminando gli errori 422 Unprocessable Content."
        },
        {
          "type": "fixed",
          "title": "Service Worker Cache",
          "description": "Corretto errore cache del service worker che tentava di salvare richieste PATCH/POST/PUT. Ora cache solo richieste GET valide, migliorando affidabilità e prestazioni offline."
        },
        {
          "type": "fixed",
          "title": "Version Popup Scrollbar",
          "description": "Rimossa scrollbar visibile sopra i pulsanti versione. Scrolling ora invisibile ma funzionante con indicatore gradiente per mostrare contenuto nascosto."
        }
      ]
    },
    {
      "version": "5.0.0",
      "date": "2025-10-30",
      "title": "Offline Mode & PWA - Foundation Complete",
      "features": [
        {
          "type": "new",
          "title": "Complete Offline Support",
          "description": "Funziona completamente senza connessione internet - perfetto per sopralluoghi in montagna. Service Worker + IndexedDB per storage locale di tutti i dati."
        },
        {
          "type": "new",
          "title": "Automatic Sync",
          "description": "Sincronizzazione automatica quando torna la connessione. Gestione intelligente della coda con retry e priorità. Upload foto e video in background."
        },
        {
          "type": "new",
          "title": "Progressive Web App (PWA)",
          "description": "Installabile su smartphone come app nativa. Funziona standalone senza browser. Shortcuts per azioni rapide (Nuovo Preventivo, Clienti, Sopralluogo)."
        },
        {
          "type": "new",
          "title": "IndexedDB Storage",
          "description": "Database locale con 6 object stores: clienti, progetti, foto, video, manutenzioni, coda API. Supporta migliaia di record offline."
        },
        {
          "type": "new",
          "title": "Visual Status Indicators",
          "description": "Indicatori visivi per stato offline (giallo), sincronizzazione in corso (blu), sync completata (verde). Sempre chiaro cosa sta succedendo."
        },
        {
          "type": "new",
          "title": "Offline Photo & Video Storage",
          "description": "Salva foto e video di sopralluoghi localmente. Upload automatico su Airtable (foto) e pCloud (video) quando torna internet."
        }
      ]
    },
    {
      "version": "4.1.0",
      "date": "2025-10-30",
      "title": "PDF Generation & Enhanced Features",
      "features": [
        {
          "type": "new",
          "title": "PRISMA Template PDF Generation",
          "description": "Generate professional PDF quotes using the full PRISMA.html template with all form data automatically populated"
        },
        {
          "type": "new",
          "title": "Authentication System",
          "description": "Secure login system with 24-hour session persistence"
        },
        {
          "type": "new",
          "title": "Session Management",
          "description": "Sessions now sync with Airtable for cloud backup and multi-device access"
        },
        {
          "type": "improved",
          "title": "Duplicate Client Detection",
          "description": "Smart detection of existing clients with one-time prompt for handling duplicates"
        },
        {
          "type": "improved",
          "title": "Auto-save System",
          "description": "Enhanced auto-save with dual storage (localStorage + Airtable) for maximum reliability"
        },
        {
          "type": "fixed",
          "title": "Session Persistence",
          "description": "Fixed issues with session data persistence across page reloads"
        }
      ]
    },
    {
      "version": "4.0.0",
      "date": "2025-10-15",
      "title": "Major UI Overhaul",
      "features": [
        {
          "type": "new",
          "title": "Modern Tab Interface",
          "description": "Completely redesigned navigation with intuitive tab-based workflow"
        },
        {
          "type": "new",
          "title": "Client Manager",
          "description": "Dedicated interface for managing multiple clients and quotes"
        },
        {
          "type": "new",
          "title": "Real-time Calculations",
          "description": "Instant cost and energy calculations as you type"
        },
        {
          "type": "improved",
          "title": "Mobile Responsive",
          "description": "Fully optimized for tablets and mobile devices with touch gestures"
        }
      ]
    },
    {
      "version": "3.5.0",
      "date": "2025-09-20",
      "title": "Airtable Integration",
      "features": [
        {
          "type": "new",
          "title": "Cloud Sync",
          "description": "Automatic synchronization with Airtable database"
        },
        {
          "type": "new",
          "title": "Offline Mode",
          "description": "Continue working without internet connection"
        }
      ]
    }
  ],
  "about": {
    "company": "SoleFacile S.r.l.",
    "developer": "PRISMA Development Team",
    "contact": "solefacilesrl@gmail.com",
    "website": "www.solefacilesrl.com",
    "description": "PRISMA is a comprehensive solar installation quoting system designed to streamline the process of creating accurate, professional quotes for photovoltaic installations."
  }
}
